public class If {
    public static void main(String [] args){
        int myInt = 1555;                                         //присвоюєм значення змінній
        if(myInt<10){                                           // вказуєм першу умову
            System.out.println("Виконана 1 умова");             // інструкція,якщо вірна перша умова
        }else if(myInt>20){                          // вказуєм другу умову,яка буде перевірятись якшо перша не виконалась
            System.out.println("Виконана 2 умова " + myInt);             // інструкція,якщо вірна друга умова
        } else{                                                 // виконує вказану інструкцію якщо не підійшла жодна з попередніх умов
            System.out.println("Не виконано жодної умови");
        }
    }
}
